"""
เขียนโปรแกรม ของโปรแกรมค านวณค่าเช่าแท็กซี่ และแสดงผลค่าเช่าแท็กซี่ที่ค านวณได้ทางหน้าจอ โดยก าหนดให้รับ
ชื่อผู้เช่าแท็กซี่ หมายเลขทะเบียนรถแท็กซี่ที่เช่า และจ านวนชั่วโมงที่เช่ารถแท็กซี่ทางแป้นพิมพ์ และค านวณหาค่าเช่ารถ
แท็กซี่จากอัตราค่าเช่าที่ก าหนดให้ดังต่อไปนี้
 
เช่ารถแท็กซี่ไม่เกิน 5 ชั่วโมง คิดชั่วโมงละ 100.00 บาท 
เช่ารถแท็กซี่ 6 - 10 คิดชั่วโมงละ 90.50 บาท 
เช่ารถแท็กซี่ 11 - 15 คิดชั่วโมงละ 80.00 บาท 
เช่ารถแท็กซี่ 16 ชั่วโมงเป็นต้นไป คิดชั่วโมงละ 70.50 บาท 
 ก าหนดหน้าจอการแสดงผลเบื้องต้นให้ ดังนี้ 
++++++++++++++++++++++++
 Program Rent Taxi
++++++++++++++++++++++++
Enter name for rent : <input>
Enter car number for rent : <input>
Enter hour for rent : <input>
++++++++++++++++++++++++
Pay for rent is : <output>
++++++++++++++++++++++++
ก าหนดให้มีฟังก์ชันในการท างานอย่างน้อย 2 ฟังก์ชันอะไรก็ได
"""
def line():
    print("------------------------------")

def rentTaxi():
    name = input("ระบุชื่อรถที่ต้องการเช่า: ")
    carNumber = int(input("ระบุหมายทะเบียน: "))
    hour = int(input("ระบุชั่วโมงที่ต้องการเช่า: "))
    total = float;
    if hour <= 5:
        total = hour*100
    elif hour <= 10:
        total = hour*90.50
    elif hour <= 15:
        total =hour*80.00
    elif hour > 16:
        total =hour*70.50

    print(f"รถ: {name}\nหมายเลขทะเบียน: {carNumber}\nชั่วโมงที่เช่า: {hour}\nยอดเงินที่ต้องจ่าย: {total} บาท")

rentTaxi()
